atomvm/AtomVM/src/platforms/esp32/components/avm_sys/platform_nifs.c
#define DEFINE_DO_HASH2(ALGORITHM, SUFFIX, IS_OTHER)                                                           \
    static InteropFunctionResult ALGORITHM##_hash_fold_fun_##IS_OTHER(term t, void *accum)                     \
    {                                                                                                          \
        mbedtls_##ALGORITHM##_context *md_ctx = (mbedtls_##ALGORITHM##_context *) accum;                       \
        if (term_is_any_integer(t)) {                                                                          \
            avm_int64_t tmp = term_maybe_unbox_int64(t);                                                       \
            if (tmp < 0 || tmp > 255) {                                                                        \
                return InteropBadArg;                                                                          \
            }                                                                                                  \
            uint8_t val = (avm_int64_t) tmp;                                                                   \
            mbedtls_##ALGORITHM##_update##SUFFIX(md_ctx, &val, 1);                                             \
        } else /* term_is_binary(t) */ {                                                                       \
            mbedtls_##ALGORITHM##_update(md_ctx, (uint8_t *) term_binary_data(t), term_binary_size(t));        \
        }                                                                                                      \
        return InteropOk;                                                                                      \
    }                                                                                                          \
                                                                                                               \
    static bool do_##ALGORITHM##_hash_##IS_OTHER(term data, unsigned char *dst)                                \
    {                                                                                                          \
        mbedtls_##ALGORITHM##_context md_ctx;                                                                  \
                                                                                                               \
        mbedtls_##ALGORITHM##_init(&md_ctx);                                                                   \
        mbedtls_##ALGORITHM##_starts##SUFFIX(&md_ctx, IS_OTHER);                                               \
                                                                                                               \
        InteropFunctionResult result = interop_chardata_fold(data, ALGORITHM##_hash_fold_fun_##IS_OTHER, NULL, (void *) &md_ctx); \
        if (UNLIKELY(result != InteropOk)) {                                                                   \
            return false;                                                                                      \
        }                                                                                                      \
                                                                                                               \
        if (UNLIKELY(mbedtls_##ALGORITHM##_finish##SUFFIX(&md_ctx, dst) != 0)) {                               \
            return false;                                                                                      \
        }                                                                                                      \
                                                                                                               \
        return true;                                                                                           \
    }

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)

DEFINE_DO_HASH(md5, _ret)
DEFINE_DO_HASH(sha1, _ret)
DEFINE_DO_HASH2(sha256, _ret, true)
DEFINE_DO_HASH2(sha256, _ret, false)
DEFINE_DO_HASH2(sha512, _ret, true)
DEFINE_DO_HASH2(sha512, _ret, false)

#else

DEFINE_DO_HASH(md5, )
DEFINE_DO_HASH(sha1, )
DEFINE_DO_HASH2(sha256, , true)
DEFINE_DO_HASH2(sha256, , false)
DEFINE_DO_HASH2(sha512, , true)
DEFINE_DO_HASH2(sha512, , false)

#endif

static term nif_crypto_hash(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    term type = argv[0];
    VALIDATE_VALUE(type, term_is_atom);
    term data = argv[1];

    unsigned char digest[MAX_MD_SIZE];
    size_t digest_len = 0;

    enum crypto_algorithm algo = interop_atom_term_select_int(crypto_algorithm_table, type, ctx->global);
    switch (algo) {
        case CryptoMd5: {
            if (UNLIKELY(!do_md5_hash(data, digest))) {
                RAISE_ERROR(BADARG_ATOM)
            }
            digest_len = 16;
            break;
        }
        case CryptoSha1: {
            if (UNLIKELY(!do_sha1_hash(data, digest))) {
                RAISE_ERROR(BADARG_ATOM)
            }
            digest_len = 20;
            break;
        }
        case CryptoSha224: {
            if (UNLIKELY(!do_sha256_hash_true(data, digest))) {
                RAISE_ERROR(BADARG_ATOM)
            }
            digest_len = 28;
            break;
        }
        case CryptoSha256: {
            if (UNLIKELY(!do_sha256_hash_false(data, digest))) {
                RAISE_ERROR(BADARG_ATOM)
            }
            digest_len = 32;
            break;
        }
        case CryptoSha384: {
            if (UNLIKELY(!do_sha512_hash_true(data, digest))) {
                RAISE_ERROR(BADARG_ATOM)
            }
            digest_len = 48;
            break;
        }
        case CryptoSha512: {
            if (UNLIKELY(!do_sha512_hash_false(data, digest))) {
                RAISE_ERROR(BADARG_ATOM)
            }
            digest_len = 64;
            break;
        }
        default:
            RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(memory_ensure_free(ctx, term_binary_heap_size(digest_len)) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    return term_from_literal_binary(digest, digest_len, &ctx->heap, ctx->global);
}

